In [1]:
import pandas as po

In [2]:
import pandas as po

In [5]:
po.read_csv('data.csv')
import numpy as np

In [6]:
df2 = po.DataFrame({'A':[1,2,np.nan], 'b':[3,np.nan,77], 'c':[4,5,8]})

In [7]:
df2

     A     b  c
0  1.0   3.0  4
1  2.0   NaN  5
2  NaN  77.0  8

In [10]:
df2>1.2

       A      b     c
0  False   True  True
1   True  False  True
2  False   True  True

In [11]:
df2.isna()

       A      b      c
0  False  False  False
1  False   True  False
2   True  False  False

In [12]:
df2['A'].fillna(value=1.5, inplace=True)

In [13]:
df2

     A     b  c
0  1.0   3.0  4
1  2.0   NaN  5
2  1.5  77.0  8

In [14]:
df2['b'].fillna(value=100,inplace=True)

In [15]:
df2

     A      b  c
0  1.0    3.0  4
1  2.0  100.0  5
2  1.5   77.0  8

# GROUP BY

In [16]:
data = {'company':['Novia','samsung','mi','Nokia','mi'],
        'employee_nmae':['ram','sham','tom','ajay','soma'],
       'salary':['100','05511','56','6000','444']}

In [17]:
data

{'company': ['Novia', 'samsung', 'mi', 'Nokia', 'mi'],
 'employee_nmae': ['ram', 'sham', 'tom', 'ajay', 'soma'],
 'salary': ['100', '05511', '56', '6000', '444']}

In [19]:
df3 = po.DataFrame(data)

In [20]:
df3

   company employee_nmae salary
0    Novia           ram    100
1  samsung          sham  05511
2       mi           tom     56
3    Nokia          ajay   6000
4       mi          soma    444